Revit 2024 API
PatternJustification Enumeration
 Justification of patterns distribution.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public enum PatternJustification
Visual Basic
Public Enumeration PatternJustification
Visual C++
public enum class PatternJustification
Members
Member name | Description
Beginning |  Patterns are distributed starting from the beginning of a railing path.
End |  Patterns are distributed starting from the ending of a railing path.
Center |  Patterns are distributed starting from the center of a railing path.
SpreadPatternToFit |  Patterns are distributed to not last excess length.
See Also
Autodesk.Revit.DB.Architecture Namespace